In [1]:
import pandas as pd

In [5]:
pd.read_excel("C://Users//hadoop//L1.xlsx")

  area  p1  p2
0    a   1   2
1    b   3   4
2    c   5   6

In [8]:
L1 = pd.read_excel("C://Users//hadoop//L1.xlsx")

In [6]:
pd.read_excel("C://Users//hadoop//L2.xlsx")

  area group  p1  p2
0    a   a-1   1   2
1    a   a-2   3   4
2    b   b-1   5   6
3    b   b-1   7   8
4    c   c-1   9  10
5    c   c-2  11  12
6    c   c-3  13  14

In [9]:
L2 = pd.read_excel("C://Users//hadoop//L2.xlsx")

In [7]:
pd.read_excel("C://Users//hadoop//L3.xlsx")

  group adword  p1  p2
0   a-1      0  11  12
1   a-2      0  13  14
2   b-1  b-1-1  15  16
3   b-1  b-1-2  17  18
4   c-1      0  19  20
5   c-2      0  21  22
6   c-3      0  23  24

In [10]:
L3 = pd.read_excel("C://Users//hadoop//L3.xlsx")

In [14]:
L1[L1['area']=='a']
#把這個寫入到第一個sheet1(area)

  area  p1  p2
0    a   1   2

In [96]:
for i in list_:
    write_in = "write_{0}".format(i)
    print(write_in)

write_a
write_b
write_c

In [159]:
pd.merge(L3,L2,on='group').drop(['p1_y','p2_y'],axis=1)

  group adword  p1_x  p2_x area
0   a-1      0    11    12    a
1   a-2      0    13    14    a
2   b-1  b-1-1    15    16    b
3   b-1  b-1-1    15    16    b
4   b-1  b-1-2    17    18    b
5   b-1  b-1-2    17    18    b
6   c-1      0    19    20    c
7   c-2      0    21    22    c
8   c-3      0    23    24    c

In [160]:
L3_plusL2 = pd.merge(L3,L2,on='group').drop(['p1_y','p2_y'],axis=1)

In [164]:
L3_plusL2[L3_plusL2['area'] == 'a']

  group adword  p1_x  p2_x area
0   a-1      0    11    12    a
1   a-2      0    13    14    a

In [165]:
for i in list_:    
    write_out = pd.ExcelWriter('write_{}.xlsx'.format(i))
    L1[L1['area']== i].to_excel(write_out,'area')
    L2[L2['area'] == i].to_excel(write_out,'group')
    L3_plusL2[L3_plusL2['area'] == i].to_excel(write_out,'adword')
    write_out.save()